"use strict"
//Задачи из LMS
//1. Мінімум

//1.1. Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17),
// дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.

//1.2. Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).


//1.3. Підрахуй суму всіх чисел в заданому користувачем діапазоні.

//1.4. Запитай у користувача 2 числа і знайди найбільший спільний дільник.

//1.5. Запитай у користувача число і виведи всі дільники цього числа.

//2. Норма
//2.1. Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.

//2.2. Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%;
// від 300 до 500 - 5%;
// від 500 і вище - 7%.

//2.3. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх,
// від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних.
// Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10)
// для введення чисел користувачем.

//2.4. Зацикли відображення днів тижня таким чином: «День тижня.
// Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.



//3. Максимум
//3.1. Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100
// і відгадай його наступним способом: кожну ітерацію циклу діли діапазон
// чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N,
// <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон.
// Початковий діапазон від 0 до 100, поділи навпіл і отримай 50.
// Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100.
// І так до тих пір, поки користувач не вибере == N
// (буде корисним почитати про алгоритм: "бінарний пошук").

//3.2. Виведи таблицю множення для всіх чисел від 2 до 9.
// Кожне число необхідно помножити на числа від 1 до 10.

//3.3. Запитай дату (день, місяць, рік) і виведи наступну за нею дату.
// Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.



//Задачи из slack
// Задания, в которых необходимо использовать WHILE.

// 1) Вывести # столько раз, сколько указал пользователь.
 function task1() {
 const num = parseInt(document.getElementById('task_1_number').value);
 let rez = '';
 let i = 0;
 while (i < num) {
 rez = rez + '#';
 i++;
 }
 document.getElementById('task_1_result').innerText = rez;
 }

 //2) Пользователь ввел число, а на экран вывелись все числа от введенного до 0.
function task2() {
 const num = parseInt(document.getElementById('task_2_number').value);
 let rez = '';
 let i = num;
 while (i >= 0) {
  rez = rez + i+ '';
  i--;
 }
 document.getElementById('task_2_result').innerText = rez;

}

 //3) Запросить число и степень. Возвести число в указанную степень и вывести результат.
 //4) Запросить 2 числа и найти все общие делители.
function task4() {
 const num1 = parseInt(document.getElementById('task_4_number1').value);
 const num2 = parseInt(document.getElementById('task_4_number2').value);
 let rez = '';
 const minNum = num1 < num2 ? num1 : num2; //пример тернарного оператора, делаем себе переменную и если num1 меньше чем num2 тогда в переменную minNum попадет num1, иначе num2.
 let i = 1;
 while (i <= minNum / 2) {
  if (num1 % i === 0 && num2 % i === 0) {
   rez = rez + i + ', ';
  }
  i++;
 }
 if (minNum === num1) {
  if (num2 % num1 === 0) {
   rez = rez + num1;
  }
 } else {
  if (num1 % num2 === 0) {
   rez = rez + num2;
  }
  document.getElementById('task_4_result').innerText = rez;
 }
}


 //5) Посчитать факториал введенного пользователем числа.

// Задания, в которых необходимо использовать DO WHILE.
// 1) Предлагать пользователю решить пример 2 + 2 * 2 до тех пор, пока он не решит его правильно.
// 2) Делить число 1000 на 2 до тех пор, пока не получится число меньше 50. Вывести это число и сколько делений произвели.

// Задания, в которых необходимо использовать FOR.
// 1) Вывести все числа от 1 до 100, которые кратные указанному пользователем числу.
// 2) Вывести каждый 4-й элемент из указанного пользователем диапазона. Пользователь указывает минимальное и максимальное значения диапазона.
// 3) Запросить число и проверить, простое ли оно. Простое число делится без остатка только на себя и на единицу.

